Revit 2024 API
ViewSchedule.Split Method (Int32)
 Splits the schedule into several segments by given segment number.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022.1
Syntax
C#
public void Split(
	int segmentNumber
)
Visual Basic
Public Sub Split ( _
	segmentNumber As Integer _
)
Visual C++
public:
void Split(
	int segmentNumber
)
Parameters
segmentNumber
Type: System.Int32
 The segment number.
Remarks
The segment number must be greater than 0.
A schedule can be split only when it is not split yet.
A titleblock revision schedule cannot be split.
Once a sheet specific schedule, i.e., the schedule is filtered by sheet, is split, the segments will be placed on its sheet view immediately.
After split, all segments will have even height limits based on the schedule height and segment number except the last segment shown on the sheet view.
The height limit of the last segment cannot be set, because the height of the schedule instances of the last segment will be determined by the schedule instances of previous segments and the height of the whole schedule.
Check SetSegmentHeight(Int32, Double) to see more about segment height.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The segment number must be greater than 1.
Autodesk.Revit.Exceptions.InvalidOperationException |  Revision schedules cannot be split. -or- A schedule filtered by sheet can't be split. -or- This ViewSchedule is split.
See Also
ViewSchedule Class
Split Overload
Autodesk.Revit.DB Namespace